[frmMain]
mnuLanguage.Caption=язык(Language)

pmnuExitTheSystem.Caption=выход из системы

mnuSystemSettings.Caption=Настройки системы
mnuParameterSetting.Caption=Параметры
mnuBootUp.Caption=запуск
mnuExitTheSystem.Caption=выход из системы

mnuReportTools.Caption=средство отчета
mnuReportDesign.Caption=составление отчета

mnuPrintLog.Caption=Просмотреть журнал печати


mnuJsonTools.Caption=тест json(bejson.com)
mnuBase64.Caption=Base64 и преобразование изображений
mnuUrlEncode.Caption=Кодировка / декодирование URL
mnuSSLTools.Caption=средство преобразования формата сертификата SSL
mnuOpenTheRootDirectory.Caption=открыть корневой каталог
mnuOpenReportDirectory.Caption=Открыть каталог отчётов
mnuOpenLogDirectory.Caption=Открыть каталог журнала
mnuOpenTheOutputfileDirectory.Caption=Открыть каталог вывода
mnuWindowDisplay.Caption=Показать окно
mnuHttpPrint.Caption=HTTTP Printing
mnuMqttPrint.Caption=печать MQTT
mnuCamera.Caption=камера
mnuIdCard.Caption=удостоверение личности
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=системная помощь
mnuAboutUs.Caption=о нас

ts_http_print.Caption=HTTTP Printing
lblPort.Caption=порт
rb_print.Caption=печать
rb_Preview.Caption=Просмотр
ButtonStart.Caption=запуск
ButtonStop.Caption=остановить

ts_mqtt_print.Caption=печать MQTT
gb_mqtt.Caption=сервер MQTT
lbl_mqtt_server_address.Caption=адрес
lbl_mqtt_server_port.Caption=порт
lbl_mqtt_server_username.Caption=Имя пользователя
lbl_mqtt_server_userpwd.Caption=пароль
lbl_mqtt_server_subscribe_topic.Caption=подписаться на темы
lbl_mqtt_server_print_verification_code.Caption=код проверки печати
ButtonStart_mqtt.Caption=запуск
ButtonStop_mqtt.Caption=остановить

ts_camera.Caption=камера
lbl_camera_device_list.Caption=Список устройств
lbl_camera_resolution.Caption=разрешающая способность
btn_open_camera.Caption=камера запуска
btn_close_camera.Caption=закрыть камеру
chk_auto_open_camera.Caption=камера автоматического запуска
chk_pal_b.Caption=защитный экран
chk_auto_top.Caption=Верхняя часть окна (всегда впереди)


ts_idcard.Caption=удостоверение личности
lbl_idcard_name.Caption=имя
lbl_idcard_sex.Caption=пол
lbl_idcard_nation.Caption=нация
lbl_idcard_birthday.Caption=Дата рождения
lbl_idcard_id.Caption=номер удостоверения личности
lbl_idcard_org.Caption=орган выдачи
lbl_idcard_addr.Caption=адрес
lbl_idcard_begin.Caption=Начало срока действия
lbl_idcard_end.Caption=окончание срока действия
lbl_idcard_type.Caption=тип устройства
btn_idcard_read.Caption=читать
lbl_idcard_msg.Caption=подсказка:

[frmAbout]
btnOk.Caption=определение
Caption=О

[LanguageString]
ini_NeedRegister=слишком много принтеров, пожалуйста, Перезагрузите модуль печати или купите версии OEM
ini_NoToken=значение токена не существует
ini_ReadIdCardError=Подсказка: Ошибка чтения карты!
ini_GetPrinterList=Получение списка принтеров
ini_CreateDir=создать каталог
ini_FailPleaseCheck=ошибка, проверьте
ini_PrintFailPleaseCheck=Ошибка печати, проверьте
ini_ReportFileNotExist=файл отчета не существует
ini_DownLoadError=Ошибка загрузки
ini_JsonFormatError=ошибка формата json
ini_PrintingTimeoutPleaseCheck=задержка печати, проверьте, пожалуйста
ini_PictureFormatError=Неверный формат изображения
ini_PdfFileNotExist=файл pdf не существует
ini_PicFileNotExist=файл pic не существует
ini_This=должно
ini_NotSupport=не поддерживается
ini_InterfaceCallFailed=Ошибка вызова интерфейса
ini_CameraNotActivated=камера не запущена
ini_SelectFolder=Выбор папки
ini_MinutesMustBeAnInteger=количество минут должно быть целое
ini_MinutesMustBeGreaterThanZero=количество минут должно быть больше нуля
ini_SelfStartingClientNameCannotBeEmpty=имя клиента не может быть пустым


ini_PdfFileCannotOpen=файл pdf не может быть открыт
ini_LicenseKeyInvalid=неверный ключ лицензии


ini_PicFileCannotOpen=Невозможно открыть файл pic
ini_UnableInitializePrinter=Невозможно инициализировать принтер
ini_PicPrint=печать pic
ini_PaperSize=размер бумаги
ini_CustomMM=другой(MM)
ini_Width=ширина
ini_Height=высота
ini_PrintingDirection=направление печати
ini_landscape=поперечный
ini_portrait=вертикальное направление
ini_MarginMM=ширина страницы(MM)
ini_Left=левый
ini_Right=справа
ini_Top=вверх
ini_Bottom=низший
ini_Center=средний
ini_VerticalPos=вертикальное положение
ini_HorizontalPos=горизонтальное положение
ini_Copys=количество порций
ini_DocumentTitle=Заголовок документа
ini_PrinterName=Имя принтера
ini_PageZoom=Масштабирование страницы
ini_Normal=установить размер печати по оригинальному изображению DPI (т. Е. Создать копию реального размера)
ini_FitToPage=растягивать изображение для страницы, уважая при этом пропорции
ini_FitToPageStretch=растягивать изображение для страницы, Игнорировать пропорции
ini_FillPage=растягивать изображение, чтобы заполнить страницу (по пропорции)
ini_SpecifiedSize=печать с абсолютным размером, указанным в параметрах абсолютной ширины и абсолютной высоты
ini_MultiplePages=печатать изображения на нескольких страницах с абсолютным шириной и абсолютным высотным параметром
ini_SpecWidth=абсолютная ширина
ini_SpecHeight=абсолютная высота
ini_LoadPic=загрузить рисунок
ini_ConfirmPrinting=печать подтверждения




ini_PrintLog=журнал печати 
ini_Date=дата 
ini_Refresh=обновить 
ini_OpenLogDirectory=Открыть каталог журнала 
ini_OpenOutputFileDirectory=Открыть каталог 
ini_ViewCustomFile=просмотреть другой файл
ini_LogList=Список журналов
ini_LogContent=содержимое журнала 
ini_PdfFile=pdf файл 
ini_Directory=оглавление 
ini_NotExist=не существует


ini_ReportDesign=составление отчета 
ini_DoubleClickToOpenTheReportFile=двойной щелчок может открыть файл отчета 
ini_NewlyAdded=Добавить
ini_Modify=Изменить
ini_Delete=Удалить
ini_Copy=копировать
ini_ReportDoesNotExist=отчёт не существует
ini_To=переходить
ini_Error=ошибка
ini_InTheListBelow_selectTheReportFileYouWantToModify=Выберите файл отчета для изменения
ini_TestReport=Тестовый отчёт
ini_AreYouSureYouWantToDelete=Подтверждение удаления
ini_DeleteConfirmation=Подтверждение удаления
ini_YouHaveChosenNotToDelete=Вы выбрали не удалять
ini_ReportNameEn=название отчета (на английском языке) 
ini_ReportNameAlias= имя отчета (псевдоним) 
ini_VersionNumber= номер версии 
ini_FileNameSuffixMustBe= суффикс имени файла должен быть 
ini_Currently= В настоящее время 
ini_TheFileNameAlreadyExists= имя файла уже существует
ini_ReportInfo=отчётная информация




ini_NoJsonFile=отсутствует файл json 
ini_PrintErrorJsonError= Ошибка печати, ошибка формата json 
ini_MustBe= необходимо 
ini_Or= или 
ini_ReportName= наименование отчета 
ini_CannotBeEmpty= не может быть пустым 
ini_MustBeIntOrFloat= Необходимо указать тип десятичной или целой дроби 
ini_DeleteLocalReportFile= Удалить локальный файл отчета 
ini_DownLoadReportFileToLocal= Загрузка удаленных отчетов 
ini_DownLoadReportFileError= Ошибка загрузки отчёта 
ini_DownLoadComplete= Загрузка завершена 
ini_EditLocalReportVersion= Изменить номер локальной версии отчета 
ini_CreateReportFile= создать файл отчета 
ini_PrintCopys= количество печатных экземпляров 
ini_MustBeInt= Должно быть целое число 
ini_MustBeGreaterThanOrEqualTo= Должно быть больше нуля 
ini_DetermineIfThePrinterExists= Определение наличия принтера 
ini_Printer= принтер 
ini_NotExistPayAttentionToCaseAndSpace= не существует, обратите внимание на размер и пробел 
ini_SetRightOffset= Настройка смещения вправо 
ini_MustBeFloat= тип плавающей точки 
ini_SetBottomOffset= Настройка смещения дна 
ini_MustBeOneOrZero= Должно быть 1 или 0 
ini_SetComponent= Настройка Панели инструментов 
ini_Component= блочная рама 
ini_ControlToArrayError= Ошибка преобразования Control в array 
ini_LoadPicError= Ошибка загрузки изображения 
ini_FormatError= ошибка формата 
ini_Parameter= Параметры 
ini_ParameterToArrayError= Ошибка преобразования параметра в array 
ini_Field= поле 
ini_FieldToArrayError= Ошибка преобразования Field в array 
ini_AFieldToArrayError= Ошибка преобразования AFILD в array 
ini_BFieldToArrayError= Ошибка преобразования BField в array 
ini_CFieldToArrayError= Ошибка преобразования CFIELD в array 
ini_DFieldToArrayError= Ошибка преобразования DField в array 
ini_EFieldToArrayError= Ошибка преобразования EField в array 
ini_FFieldToArrayError= Ошибка преобразования Ffield в array 
ini_GFieldToArrayError= Ошибка преобразования GField в array 
ini_HFieldToArrayError= Ошибка преобразования HFIELD в array 
ini_IFieldToArrayError= Ошибка преобразования IFIELD в array 
ini_JFieldToArrayError= Ошибка преобразования JField в array 
ini_DataRow= строка данных 
ini_DataToArrayError=  Ошибка преобразования DATA в array 
ini_ADataToArrayError= Ошибка преобразования ADATA в array 
ini_BDataToArrayError= Ошибка преобразования BDATA в array 
ini_CDataToArrayError= Ошибка преобразования CDATA в array 
ini_DDataToArrayError= Ошибка преобразования DDATA в array 
ini_EDataToArrayError= Ошибка преобразования EDATA в array 
ini_FDataToArrayError= Ошибка преобразования FDATA в array 
ini_GDataToArrayError= Ошибка преобразования GData в array 
ini_HDataToArrayError= Ошибка преобразования HData в array 
ini_IDataToArrayError= Ошибка преобразования IData в array 
ini_JDataToArrayError= Ошибка преобразования JData в array 
ini_SetOffsetValue= Настройка смещения 
ini_SetPrinterName= Установить имя принтера 
ini_ExportFileYes= Экспортировать файл 
ini_ExportFileName= экспортировать имя файла 
ini_ExportComplete= вывод закончен 
ini_PreviewComplete= Просмотр закончен 
ini_PrintComplete= Печать завершена 
ini_LoadReport= Загрузка отчета 
ini_ADataToArraySuccess= преобразование DATA в array успешно 
ini_BDataToArraySuccess= преобразование BDATA в array успешно 
ini_CDataToArraySuccess= преобразование CDATA в array успешно 
ini_DDataToArraySuccess= преобразование DDATA в array успешно 
ini_EDataToArraySuccess= преобразование EDATA в array успешно 
ini_FDataToArraySuccess= преобразование FDATA в array успешно 
ini_GDataToArraySuccess= преобразование GData в array успешно 
ini_HDataToArraySuccess= преобразование HData в array успешно 
ini_IDataToArraySuccess= преобразование IDATA в array успешно 
ini_JDataToArraySuccess= преобразование JData в array успешно




ini_NoClientID=Нет значений cliented 
ini_ClientIDEmpty= Cliented не может быть пустым 
ini_PrinteridWrong= Ошибка печати 
ini_PrinterpwdWrong= Ошибка печати 
ini_MethodWrong= ошибка method 
ini_PingSuccessful= успех ping 
ini_PingTimeout= время ожидания ping 
ini_ConnectionResults= результат соединения 
ini_subscribeResultMessageID= результат подписки, идентификатор сообщения 
ini_UnsubscribeResultMessageID= отменить подписку, идентификатор сообщения 
ini_Received_release_confirmation_QoS_1_message_ID= получение подтверждения публикации Qos 1, идентификатор сообщения 
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID= получение подтверждения публикации Qos 2, шаг 1, идентификатор сообщения 
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID= получение подтверждения публикации Qos 2, шаг 3, идентификатор сообщения 
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID= получение подтверждения публикации Qos 2, шаг 2, идентификатор сообщения 
ini_ConnectionTimedOut= время ожидания соединения 
ini_PublishingTimeout= задержка публикации 
ini_MessageID= Идентификатор сообщения 
ini_Topic= тема 
ini_Content= Содержание 
ini_CameraOn= камера открыта 
ini_OpenFailed= Ошибка открытия 
ini_NoVideoDevicesWereFound= видео не найдено 
ini_Stopped= Остановлено 
ini_CameraStartFailed= Ошибка запуска веб - камеры 
ini_CameraOff= камера выключена 
ini_Disconnect= отключать соединение 
ini_Started= уже запущен 
ini_Failed_to_start_Please_try_another_port= Ошибка запуска, попробуйте другой порт 
ini_Minimum_desktop_requirements_Windows_Vista= минимальные требования к рабочему столу: Windows Vista 
ini_Minimum_server_requirements_Windows_Server_2008= минимальные требования к серверу: Windows Server 2008



ini_Table_structure_field_type=тип поля структуры таблицы: ftBlob (формат base64), ftstring ftInteger ftBoolean, ftFloat, ftCurrency, ftDateTime, 
ini_size_ftString_ftInteger_ftBlob=Size (ftString устанавливает фактическую длину, другие настройки - 0, например ftInteger ftBlob и другие - 0) 
ini_Currently_10_tables_are_supported=В настоящее время поддерживаются 10 таблиц ABCDEFGHIJ, например Таблица A содержит AFILD ADATA вплоть до таблицы J, содержащей JField JData


ini_ParameterSetting=Параметры
ini_Log_save_path_if_empty_the_default_is_log_directory= путь к журналу (по умолчанию - log) 
ini_Clear_log_on_startup= Очистить журнал при запуске 
ini_Clear_log_on_exit= Очистить журнал при выходе 
ini_In_operation_every= выполняется каждые 20 минут, очищается один раз
ini_Save_settings= сохранить настройки 
ini_journal= журнал 
ini_report_form= ведомость 
ini_Report_template_path_empty_default_report_directory= путь к шаблону отчёта (пустой каталог отчётов по умолчанию) 
ini_Export_file_path_empty_default_export_directory= путь к файлу экспорта (пустой каталог экспорта по умолчанию) 
ini_Export_file_format_blank_default_PDF_format= Экспортировать файл в формат (по умолчанию - pdf) 
ini_Enable_token= Включить token 
ini_Token_list_one_for_each_line_similar_to_white_list= Список Token (строка, похожая на белый список) 
ini_other= Прочее 
ini_Minimize_after_startup= минимизация после запуска 
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients= Изменить имя клиента, чтобы он мог запустить несколько клиентов

 





ini_URL_encoding_decoding=Кодировка / декодирование URL 
ini_URLEncode= Кодировка UrlEncode 
ini_URLDecode= декодирование UrlDecode




ini_Base64_and_image_conversion=Base64 и преобразование изображений 
ini_exceed_100k= для того чтобы сбалансировать эффективность в производственной среде, общие индивидуальные фотофайлы не должны превышать 100 K.
ini_Base64_string= строка base64 
ini_paste= Вставить 
ini_Turn_to_picture= Преобразовать в рисунок 
ini_picture= рисунок


 ini_Connection=соединение
 ini_write_log=Создать журнал